; domain
(define (domain sliding-puzzle)
  (:requirements :strips :typing)
  
  (:types tile position)
  
  (:predicates
    (at ?t - tile ?p - position)
    (empty ?p - position)
    (adjacent ?p1 - position ?p2 - position)
  )

  (:action move
    :parameters (?t - tile ?from - position ?to - position)
    :precondition (and
      (at ?t ?from)
      (empty ?to)
      (adjacent ?from ?to)
    )
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
      (not (empty ?to))
      (empty ?from)
    )
  )
)

; problem
(define (problem sliding-puzzle-3x3)
  (:domain sliding-puzzle)

  (:objects
    t1 t2 t3 t4 t5 t6 t7 t8 - tile
    p11 p12 p13 p21 p22 p23 p31 p32 p33 - position
  )

  (:init
    (at t4 p11)
    (at t7 p12)
    (at t8 p13)
    (at t5 p21)
    (at t3 p23)
    (at t6 p31)
    (at t1 p32)
    (at t2 p33)
    (empty p22)

    (adjacent p11 p12)
    (adjacent p11 p21)
    (adjacent p12 p11)
    (adjacent p12 p13)
    (adjacent p12 p22)
    (adjacent p13 p12)
    (adjacent p13 p23)
    (adjacent p21 p11)
    (adjacent p21 p22)
    (adjacent p21 p31)
    (adjacent p22 p12)
    (adjacent p22 p21)
    (adjacent p22 p23)
    (adjacent p22 p32)
    (adjacent p23 p13)
    (adjacent p23 p22)
    (adjacent p23 p33)
    (adjacent p31 p21)
    (adjacent p31 p32)
    (adjacent p32 p22)
    (adjacent p32 p31)
    (adjacent p32 p33)
    (adjacent p33 p23)
    (adjacent p33 p32)
  )

  (:goal
    (and
      (at t1 p11)
      (at t2 p12)
      (at t3 p13)
      (at t4 p21)
      (at t5 p22)
      (at t6 p23)
      (at t7 p31)
      (at t8 p32)
      (empty p33)
    )
  )
)

; plan
1. (move t7 p12 p22)
   deleted: (at t7 p12) (empty p22)
   added: (at t7 p22) (empty p12)
   goals met: 0 of 9
2. (move t4 p11 p12)
   deleted: (at t4 p11) (empty p12)
   added: (at t4 p12) (empty p11)
   goals met: 0 of 9
3. (move t5 p21 p11)
   deleted: (at t5 p21) (empty p11)
   added: (at t5 p11) (empty p21)
   goals met: 0 of 9
4. (move t7 p22 p21)
   deleted: (at t7 p22) (empty p21)
   added: (at t7 p21) (empty p22)
   goals met: 0 of 9
5. (move t1 p32 p22)
   deleted: (at t1 p32) (empty p22)
   added: (at t1 p22) (empty p32)
   goals met: 0 of 9
6. (move t6 p31 p32)
   deleted: (at t6 p31) (empty p32)
   added: (at t6 p32) (empty p31)
   goals met: 0 of 9
7. (move t7 p21 p31)
   deleted: (at t7 p21) (empty p31)
   added: (at t7 p31) (empty p21)
   goals met: 1 of 9
8. (move t1 p22 p21)
   deleted: (at t1 p22) (empty p21)
   added: (at t1 p21) (empty p22)
   goals met: 1 of 9
9. (move t4 p12 p22)
   deleted: (at t4 p12) (empty p22)
   added: (at t4 p22) (empty p12)
   goals met: 1 of 9
10. (move t5 p11 p12)
   deleted: (at t5 p11) (empty p12)
   added: (at t5 p12) (empty p11)
   goals met: 1 of 9
11. (move t1 p21 p11)
   deleted: (at t1 p21) (empty p11)
   added: (at t1 p11) (empty p21)
   goals met: 2 of 9
12. (move t4 p22 p21)
   deleted: (at t4 p22) (empty p21)
   added: (at t4 p21) (empty p22)
   goals met: 3 of 9
13. (move t3 p23 p22)
   deleted: (at t3 p23) (empty p22)
   added: (at t3 p22) (empty p23)
   goals met: 3 of 9
14. (move t8 p13 p23)
   deleted: (at t8 p13) (empty p23)
   added: (at t8 p23) (empty p13)
   goals met: 3 of 9
15. (move t5 p12 p13)
   deleted: (at t5 p12) (empty p13)
   added: (at t5 p13) (empty p12)
   goals met: 3 of 9
16. (move t3 p22 p12)
   deleted: (at t3 p22) (empty p12)
   added: (at t3 p12) (empty p22)
   goals met: 3 of 9
17. (move t8 p23 p22)
   deleted: (at t8 p23) (empty p22)
   added: (at t8 p22) (empty p23)
   goals met: 3 of 9
18. (move t2 p33 p23)
   deleted: (at t2 p33) (empty p23)
   added: (at t2 p23) (empty p33)
   goals met: 4 of 9
19. (move t6 p32 p33)
   deleted: (at t6 p32) (empty p33)
   added: (at t6 p33) (empty p32)
   goals met: 3 of 9
20. (move t8 p22 p32)
   deleted: (at t8 p22) (empty p32)
   added: (at t8 p32) (empty p22)
   goals met: 4 of 9
21. (move t2 p23 p22)
   deleted: (at t2 p23) (empty p22)
   added: (at t2 p22) (empty p23)
   goals met: 4 of 9
22. (move t5 p13 p23)
   deleted: (at t5 p13) (empty p23)
   added: (at t5 p23) (empty p13)
   goals met: 4 of 9
23. (move t3 p12 p13)
   deleted: (at t3 p12) (empty p13)
   added: (at t3 p13) (empty p12)
   goals met: 5 of 9
24. (move t2 p22 p12)
   deleted: (at t2 p22) (empty p12)
   added: (at t2 p12) (empty p22)
   goals met: 6 of 9
25. (move t5 p23 p22)
   deleted: (at t5 p23) (empty p22)
   added: (at t5 p22) (empty p23)
   goals met: 7 of 9
26. (move t6 p33 p23)
   deleted: (at t6 p33) (empty p23)
   added: (at t6 p23) (empty p33)
   goals met: 9 of 9
